SrvrtsRefDOCMGRDEMO/src/Enums/ВидыДействийПриОбработкеВходящихПисем/ВидыДействийПриОбработкеВходящихПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДействийПриОбработкеВходящихПисем</name>
  <enumValues>
    <name>ПереместитьВУказаннуюПапку</name>
  </enumValues>
  <enumValues>
    <name>УстановитьУказанныйФлаг</name>
  </enumValues>
  <enumValues>
    <name>УстановитьПометкуПрочтения</name>
  </enumValues>
  <enumValues>
    <name>ОтветитьСУказаннымТекстом</name>
  </enumValues>
  <enumValues>
    <name>ПометитьНаУдаление</name>
  </enumValues>
  <enumValues>
    <name>УстановитьУказанныйПроект</name>
  </enumValues>
  <enumValues>
    <name>ОстановитьПроверкуДругихПравил</name>
  </enumValues>
</mdclass:Enum>

SrvrtsRefDOCMGRDEMO/src/Enums/ВидыДействийПриОбработкеВходящихПисем/ManagerModule.bsl
Функция ВычислитьТекстовоеОписаниеСпискаЗначений(ВидДействия, СписокЗначений) Экспорт
	
	Представление = "";
	
	Если СписокЗначений.Количество() = 0
		Или Не ЗначениеЗаполнено(СписокЗначений[0].Значение) Тогда
		Возврат Представление;
	КонецЕсли;
	
	Если ВидДействия = Перечисления.ВидыДействийПриОбработкеВходящихПисем.ПереместитьВУказаннуюПапку Тогда
		Представление = Справочники.ПапкиПисем.ПолучитьПолныйПутьПапки(СписокЗначений[0].Значение);
	ИначеЕсли ВидДействия = Перечисления.ВидыДействийПриОбработкеВходящихПисем.УстановитьУказанныйФлаг Тогда
		Если ЗначениеЗаполнено(СписокЗначений[0].Значение) Тогда
			Представление = ОбщегоНазначения.ИмяЗначенияПеречисления(СписокЗначений[0].Значение);
		КонецЕсли;
	Иначе
		Представление = Строка(СписокЗначений[0].Значение);
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ОтрицаниеДействия(ВидДействия) Экспорт
	
	Если ВидДействия = Перечисления.ВидыДействийПриОбработкеВходящихПисем.УстановитьПометкуПрочтения Тогда
		Возврат НСтр("ru = 'НЕ устанавливать пометку прочтения'");
	ИначеЕсли ВидДействия = Перечисления.ВидыДействийПриОбработкеВходящихПисем.ОстановитьПроверкуДругихПравил Тогда
		Возврат НСтр("ru = 'НЕ останавливать проверку других правил'");
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Нстр("ru = 'НЕ %1'"),
		Строка(ВидДействия));
	
КонецФункции
